[M_BloodCrystals MissionDefinition]
MissionName="Glass of blood"
MissionDescription="Lord Hammerlocke wants to attack Crystal and asks him to kill her.."
TurnInDescription="Realize that the fastest way to destroy a crystal is to break it."
MissionSummary="Kill the mirror."
MissionGiver="Mr. Hammerlock"
MissionTurnInLocation="Sir Hammerlock"
TeaserText="How many hits does it take to get crystal juice? Let's get together and see the audience.."

[M_BloodCrystals:BloodCrystals_FindCrystalisk MissionObjectiveDefinition]
ProgressMessage="return to the mirror"

[M_BloodCrystals:BloodCrystals_KillCrystalisks MissionObjectiveDefinition]
ProgressMessage="WOW"

[M_BloodCrystals:BloodCrystals_Melee MissionObjectiveDefinition]
ProgressMessage="Destroy the weapon by hitting it"

[M_BloodCrystals:MissionObjectiveSetDefinition_0 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_BloodCrystals:MissionObjectiveSetDefinition_1 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_BloodCrystals:MissionObjectiveSetDefinition_2 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

